[{"text":"\nTHIS AGREEMENT is made as of the 8th day of May, 1998 by and between\nSIBONEY LEARNING GROUP (\"Siboney\") with an address at 8135 Forsyth, Suite 212,\nSt. Louis, Missouri 63105, United States of America and NECTAR FOUNDATION\n(\"NECTAR\") with an address at 10 Bowhill Avenue, Nepean, Ontario, Canada K2E\n6S7.","intent":"effectiveDate&PartyNames&Address","entities":[{"start":34,"end":54,"value":"8th day of May, 1998","entity":"effectiveDate"},{"start":70,"end":92,"value":"SIBONEY LEARNING GROUP","entity":"firstParty"},{"start":205,"end":222,"value":"NECTAR FOUNDATION","entity":"secondParty"}]},{"text":"7. Guaranteed Minimum Royalties. Siboney will pay NECTAR a guaranteed\nminimum royalty payment totaling $180,000 (in U.S. Dollars). This guaranteed\nroyalty will accrue in specified amounts (each, a \"Guaranteed Amount\") for\ncertain periods (each, a \"Guarantee Period) and be payable as follows: $30,000\nwill accrue on December 31, 1999 and be payable January 31, 2000; $60,000 will\naccrue on December 31, 2000 and be payable January 31, 2001 and $90,000 will\naccrue on December 31, 2001 and be payable January 31, 2002. Earned Royalties\nwill be credited against the applicable Guaranteed Amount, if any. Earned\nRoyalties for any Guarantee Period in excess of the Guaranteed Amount for that\nperiod shall be credited dollar for dollar to reduce the Guaranteed Amount for\nthe following guarantee period. For example, if Earned Royalties accrued as of\nDecember 31, 1999 total $40,000, then the Guaranteed Amount payable January 31,\n2001 shall be reduced to $50,000. The guaranteed minimum royalty payment does\nnot affect Siboney's obligation to pay all Earned Royalties accrued during a\nparticular period.","intent":"effectiveDate&PartyNames&Address","entities":[{"start":467,"end":484,"value":"December 31, 2001","entity":"validity"}]},{"text":"12. Term and Termination. This Agreement shall be effective upon\nexecution and shall remain in effect until terminated by either party. NECTAR\nmay terminate this Agreement after December 31, 2001, on 6 months notice to\nSiboney, in the event Earned Royalties for a calendar year do not meet or exceed\n$30,000 (in U.S. Dollars). Siboney may terminate this Agreement on 6 months\nnotice any time after December 31, 2001. Upon termination pursuant to this\nSection, (a) the licenses granted herein shall terminate except as to those\nModified Software products already distributed or sublicensed by Siboney, (b)\nSiboney shall have no rights to license or distribute any Modified Software not\ninvoiced as of the end of the 6-month period and (c) Siboney remains obligated\nfor Earned Royalties due on Modified Software invoiced prior to the end of such\n6-month period. This Agreement will be terminated automatically upon the filing\nof a petition in bankruptcy by or against Siboney.","intent":"effectiveDate&PartyNames&Address","entities":[{"start":178,"end":195,"value":"December 31, 2001","entity":"validity"}]},{"text":"SIBONEY CORPORATION NECTAR FOUNDATION","intent":"effectiveDate&PartyNames&Address","entities":[{"start":20,"end":37,"value":"NECTAR FOUNDATION","entity":"secondParty"}]},{"text":"\nTHIS AMENDMENT TO SOFTWARE LICENSE AGREEMENT (\"Amendment\") is made as\nof the 8th day of September, 1999 by and between SIBONEY LEARNING GROUP\n(\"Siboney\") with an address at 8135 Forsyth, Suite 212, St. Louis, Missouri\n63105, United States of America and NECTAR FOUNDATION (\"NECTAR\") with an address\nat 10 Bowhill Avenue, Nepean, Ontario, Canada K2E 6S7.","intent":"effectiveDate&PartyNames&Address","entities":[{"start":120,"end":142,"value":"SIBONEY LEARNING GROUP","entity":"firstParty"},{"start":174,"end":250,"value":"8135 Forsyth, Suite 212, St. Louis, Missouri\n63105, United States of America","entity":"firstPartyAddress"},{"start":255,"end":272,"value":"NECTAR FOUNDATION","entity":"secondParty"},{"start":303,"end":353,"value":"10 Bowhill Avenue, Nepean, Ontario, Canada K2E 6S7","entity":"secondPartyAddress"}]},{"text":"A. Siboney and NECTAR entered into a software license agreement made as\nof the 8th day of May, 1998 (the \"License Agreement\").","intent":"effectiveDate&PartyNames&Address","entities":[{"start":79,"end":99,"value":"8th day of May, 1998","entity":"effectiveDate"}]},{"text":"\"Siboney will pay NECTAR a guaranteed minimum royalty payment totaling\n$350,000 (in U.S. Dollars). This guaranteed royalty will accrue in\nspecified amounts (each, a \"Guaranteed Amount\") for certain periods\n(each, a \"Guarantee Period) and be payable as follows: $100,000 will\naccrue on December 31, 1999 and be payable January 31, 2000; $125,000\nwill accrue on December 31, 2000 and be payable January 31, 2001 and\n$125,000 will accrue on December 31, 2001 and be payable January 31,\n2002. Earned Royalties will be credited against the applicable\nGuaranteed Amount, if any. Earned Royalties for any Guarantee Period in\nexcess of the Guaranteed Amount for that period shall be credited\ndollar for dollar to reduce the Guaranteed Amount for the following\nguarantee period. For example, if Earned Royalties accrued as of\nDecember 31, 1999 total $120,000, then the Guaranteed Amount payable\nJanuary 31, 2001 shall be reduced to $105,000. The guaranteed minimum\nroyalty payment does not affect Siboney's obligation to pay all Earned\nRoyalties accrued during a particular period.\"","intent":"effectiveDate&PartyNames&Address","entities":[{"start":438,"end":455,"value":"December 31, 2001","entity":"validity"}]},{"text":"\nSIBONEY LEARNING GROUP","intent":"effectiveDate&PartyNames&Address","entities":[{"start":1,"end":23,"value":"SIBONEY LEARNING GROUP","entity":"firstParty"}]},{"text":"\nNECTAR FOUNDATION","intent":"effectiveDate&PartyNames&Address","entities":[{"start":1,"end":18,"value":"NECTAR FOUNDATION","entity":"secondParty"}]},{"text":"This Software License Agreement (this “Agreement”) is made and entered into this 29th day of March, 2005 (the “Effective Date”), by and between EXPRESS DIGITAL GRAPHICS, INC., a Colorado corporation with offices at 9780 Mt. Pyramid Ct., Suite 120, Englewood, CO 80112 (“Licensor”) and CPI CORP., a Delaware corporation with offices at 1706 Washington Avenue, St. Louis, MO 63103 (“Licensee”). In consideration of the mutual covenants contained herein and for other good and valuable consideration, the receipt and sufficiency of which are hereby acknowledged, the parties hereby agree as follows:","intent":"effectiveDate&PartyNames&Address","entities":[{"start":81,"end":104,"value":"29th day of March, 2005","entity":"effectiveDate"},{"start":144,"end":174,"value":"EXPRESS DIGITAL GRAPHICS, INC.","entity":"firstParty"},{"start":335,"end":378,"value":"1706 Washington Avenue, St. Louis, MO 63103","entity":"firstPartyAddress"},{"start":285,"end":294,"value":"CPI CORP.","entity":"secondParty"}]},{"text":"15.13  “Transition Services” Upon termination or expiration of this Agreement for any reason, Licensee shall be entitled to continue\nto use and Licensor shall continue to provide the Licensed Technology then being provided for a minimum\nof fifteen (15) months after such termination or expiration (the “Transition Period”),\non the same terms as set forth herein.","intent":"effectiveDate&PartyNames&Address","entities":[{"start":240,"end":259,"value":"fifteen (15) months","entity":"validity"}]},{"text":"\nPARK CITY GROUP, INC. CANNON EQUIPMENT COMPANY\nP.O. BOX 5000 15100 BUSINESS PARKWAY\nPARK CITY, UTAH 84060 ROSEMOUNT, MN 55068\nATTN: RANDALL K. FIELDS ATTN:","intent":"effectiveDate&PartyNames&Address","entities":[{"start":1,"end":22,"value":"PARK CITY GROUP, INC.","entity":"firstParty"}]},{"text":"Licensee: Licensor:\nCANNON EQUIPMENT COMPANY PARK CITY GROUP, INC.","intent":"effectiveDate&PartyNames&Address","entities":[{"start":45,"end":66,"value":"PARK CITY GROUP, INC.","entity":"firstParty"}]},{"text":"We have copyrights in the Product, and patents or patents pending in\nportions of the Product, and retain all intellectual property rights in\ninventions, applications and other works of authorship prepared or derived using\nthe Product, excluding your proprietary business information, materials, trade\nmarks and forms reproduced in your implementation of the Product. The Product\ncontains trade secrets and information proprietary to us. In addition, you may\nlearn other information, which we designate as, or from its nature or the\ncircumstances of its disclosure should have been known to be, confidential or\nproprietary to us. Unless compelled by legal process, you may not use, disclose,\nprovide or otherwise make the Product or any such information (including the\nterms of this License) available to any person other than your employees with a\nneed to know, persons retained for its installation, your agents, consultants\nand customers bound by confidentiality covenants consistent with your\nconfidentiality obligations hereunder, and will ensure that any access to the\nProduct or such information will comply with this License. The foregoing\nobligations shall not apply to information which: (i) is publicly available\nprior to the date of this agreement; (ii) becomes publicly available after the\ndate of this agreement through no wrongful act of the Receiving Party; (iii) is\nfurnished to others by the Disclosing Party without any proprietary restrictions\non their right to use or disclose; (iv) is known by the Receiving Party without\nany proprietary restrictions at the time of receipt of such information from the\nDisclosing Party or becomes rightfully known to the receiving Party without\nproprietary restrictions from a source other than the Disclosing Party; or (v)\nis independently developed by the Receiving Party by persons who did not have\naccess, directly or indirectly, to the Proprietary Information.","intent":"effectiveDate&PartyNames&Address","entities":[{"start":629,"end":654,"value":"Unless compelled by legal","entity":"validity"}]},{"text":"You also have copyrights in your products, and/or patents or patents\npending in your products, and we acknowledge and agree that you retain all\nintellectual property rights in inventions, applications and other works of\nauthorship prepared or derived using your products, excluding our proprietary\nbusiness information, materials, trade marks and forms reproduced in your\nimplementation of the Product. In the course of our relationship we may learn\nother information, which you designate as, or from its nature or the\ncircumstances of its disclosure should have been known to be, confidential or\nproprietary to you. Unless compelled by legal process, we will not use,\ndisclose, provide or otherwise make any such information (including the terms of\nthis License) available to any person other than our employees with a need to\nknow, persons retained for its installation, our agents, and consultants bound\nby confidentiality covenants consistent with our confidentiality obligations\nhereunder, and will ensure that any access to your products or such information\nwill comply with this paragraph. The foregoing obligations shall not apply to\ninformation which: (i) is publicly available prior to the date of this\nagreement; (ii) becomes publicly available after the date of this agreement\nthrough no wrongful act of the Receiving Party; (iii) is furnished to others by\nthe Disclosing Party without any proprietary restrictions on their right to use\nor disclose; (iv) is known by the Receiving Party without any proprietary\nrestrictions at the time of receipt of such information from the Disclosing\nParty or becomes rightfully known to the receiving Party without proprietary\nrestrictions from a source other than the Disclosing Party; or (v) is\nindependently developed by the Receiving Party by persons who did not have\naccess, directly or indirectly, to the Proprietary Information.","intent":"effectiveDate&PartyNames&Address","entities":[{"start":617,"end":642,"value":"Unless compelled by legal","entity":"validity"}]},{"text":"We will defend you against claims that the Software or any portion\nthereof infringes a U.S. patent or copyright, and pay (a) all costs, damages and\nattorney's fees finally awarded against you as a result of such claim, and (b)\nany settlement of such claim, provided that you notify us promptly in writing of\nsuch claim, give us complete authority and control of, and fully cooperate with\nus in, the defense and settlement of such claim. If any such claim occurs, or in\nour sole opinion is likely to occur, we will in our sole discretion and at our\nown expense (i) procure for you the right to continue use of the infringing\nSoftware, (ii) modify or replace the Software so that it becomes non-infringing,\nwithout impairing its functionality, or (iii) direct you to cease using the\ninfringing Software. If we direct you to cease use, or if we cannot provide a","intent":"effectiveDate&PartyNames&Address","entities":[{"start":347,"end":372,"value":"and control of, and fully","entity":"effectiveDate"},{"start":55,"end":147,"value":"any portion\nthereof infringes a U.S. patent or copyright, and pay (a) all costs, damages and","entity":"firstPartyAddress"},{"start":148,"end":158,"value":"attorney's","entity":"secondParty"},{"start":212,"end":249,"value":"claim, and (b)\nany settlement of such","entity":"secondPartyAddress"}]},{"text":"10.1 Attorney's Fees. The prevailing party in any legal action\nconcerning this License is entitled to recover its reasonable attorney's fees\nand costs following a final judgment.","intent":"effectiveDate&PartyNames&Address","entities":[{"start":125,"end":135,"value":"attorney's","entity":"secondParty"}]}]